---
kind: type
id: T:Autodesk.Revit.DB.Plumbing.PipeType
source: html/7d3cc77e-0148-a23b-8142-7e08ebdad6b7.htm
---
# Autodesk.Revit.DB.Plumbing.PipeType

A pipe type element.

## Syntax (C#)
```csharp
public class PipeType : MEPCurveType
```